app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("name", "updated_at", "hashed_password", "username", "student_number", "created_at") VALUES('testi', '2009-11-26 22:57:39', 'f1e1c6ea766397606475ab41d7f124258da887b9', 'testi', NULL, '2009-11-26 22:57:39')